PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p16lf1786.inc
;----- PSMC2DBR Bits -----------------------------------------------------
PSMC2DBR0        EQU  H'0000'
PSMC2DBR1        EQU  H'0001'
PSMC2DBR2        EQU  H'0002'
PSMC2DBR3        EQU  H'0003'
PSMC2DBR4        EQU  H'0004'
PSMC2DBR5        EQU  H'0005'
PSMC2DBR6        EQU  H'0006'
PSMC2DBR7        EQU  H'0007'


;----- PSMC2DBF Bits -----------------------------------------------------
PSMC2DBF0        EQU  H'0000'
PSMC2DBF1        EQU  H'0001'
PSMC2DBF2        EQU  H'0002'
PSMC2DBF3        EQU  H'0003'
PSMC2DBF4        EQU  H'0004'
PSMC2DBF5        EQU  H'0005'
PSMC2DBF6        EQU  H'0006'
PSMC2DBF7        EQU  H'0007'


;----- PSMC2BLKR Bits -----------------------------------------------------
PSMC2BLKR0       EQU  H'0000'
PSMC2BLKR1       EQU  H'0001'
PSMC2BLKR2       EQU  H'0002'
PSMC2BLKR3       EQU  H'0003'
PSMC2BLKR4       EQU  H'0004'
PSMC2BLKR5       EQU  H'0005'
PSMC2BLKR6       EQU  H'0006'
PSMC2BLKR7       EQU  H'0007'


;----- PSMC2BLKF Bits -----------------------------------------------------
PSMC2BLKF0       EQU  H'0000'
PSMC2BLKF1       EQU  H'0001'
PSMC2BLKF2       EQU  H'0002'
PSMC2BLKF3       EQU  H'0003'
PSMC2BLKF4       EQU  H'0004'
PSMC2BLKF5       EQU  H'0005'
PSMC2BLKF6       EQU  H'0006'
PSMC2BLKF7       EQU  H'0007'


;----- PSMC2FFA Bits -----------------------------------------------------
PSMC2FFA0        EQU  H'0000'
PSMC2FFA1        EQU  H'0001'
PSMC2FFA2        EQU  H'0002'
PSMC2FFA3        EQU  H'0003'


;----- PSMC2STR0 Bits -----------------------------------------------------
P2STRA           EQU  H'0000'
P2STRB           EQU  H'0001'


;----- PSMC2STR1 Bits -----------------------------------------------------
P2HSMEN          EQU  H'0000'
P2LSMEN          EQU  H'0001'
P2SSYNC          EQU  H'0007'


;----- PSMC3CON Bits -----------------------------------------------------
P3DBRE           EQU  H'0004'
P3DBFE           EQU  H'0005'
PSMC3LD          EQU  H'0006'
PSMC3EN          EQU  H'0007'

P3MODE0          EQU  H'0000'
P3MODE1          EQU  H'0001'
P3MODE2          EQU  H'0002'
P3MODE3          EQU  H'0003'


;----- PSMC3MDL Bits -----------------------------------------------------
P3MDLBIT         EQU  H'0005'
P3MDLPOL         EQU  H'0006'
P3MDLEN          EQU  H'0007'

P3MSRC0          EQU  H'0000'
P3MSRC1          EQU  H'0001'
P3MSRC2          EQU  H'0002'
P3MSRC3          EQU  H'0003'


;----- PSMC3SYNC Bits -----------------------------------------------------
P3SYNC0          EQU  H'0000'
P3SYNC1          EQU  H'0001'
P3SYNC2          EQU  H'0002'
P3DCPOL          EQU  H'0005'
P3PRPOL          EQU  H'0006'
P3POFST          EQU  H'0007'


;----- PSMC3CLK Bits -----------------------------------------------------
P3CSRC0          EQU  H'0000'
P3CSRC1          EQU  H'0001'
P3CPRE0          EQU  H'0004'
P3CPRE1          EQU  H'0005'



;----- PSMC3OEN Bits -----------------------------------------------------
P3OEA            EQU  H'0000'
P3OEB            EQU  H'0001'


;----- PSMC3POL Bits -----------------------------------------------------
P3POLA           EQU  H'0000'
P3POLB           EQU  H'0001'
P3INPOL          EQU  H'0006'


;----- PSMC3BLNK Bits -----------------------------------------------------
P3REBM0          EQU  H'0000'
P3REBM1          EQU  H'0001'
P3FEBM0          EQU  H'0004'
P3FEBM1          EQU  H'0005'


;----- PSMC3REBS Bits -----------------------------------------------------
P3REBSC1         EQU  H'0001'
P3REBSC2         EQU  H'0002'
P3REBSC3         EQU  H'0003'
P3REBSC4         EQU  H'0004'
P3REBSIN         EQU  H'0007'


;----- PSMC3FEBS Bits -----------------------------------------------------
P3FEBSC1         EQU  H'0001'
P3FEBSC2         EQU  H'0002'
P3FEBSC3         EQU  H'0003'
P3FEBSC4         EQU  H'0004'
P3FEBSIN         EQU  H'0007'


;----- PSMC3PHS Bits -----------------------------------------------------
P3PHST           EQU  H'0000'
P3PHSC1          EQU  H'0001'
P3PHSC2          EQU  H'0002'
P3PHSC3          EQU  H'0003'
P3PHSC4          EQU  H'0004'
P3PHSIN          EQU  H'0007'


;----- PSMC3DCS Bits -----------------------------------------------------
P3DCST           EQU  H'0000'
P3DCSC1          EQU  H'0001'
P3DCSC2          EQU  H'0002'
P3DCSC3          EQU  H'0003'
P3DCSC4          EQU  H'0004'
P3DCSIN          EQU  H'0007'


;----- PSMC3PRS Bits -----------------------------------------------------
P3PRST           EQU  H'0000'
P3PRSC1          EQU  H'0001'
P3PRSC2          EQU  H'0002'
P3PRSC3          EQU  H'0003'
P3PRSC4          EQU  H'0004'
P3PRSIN          EQU  H'0007'


;----- PSMC3ASDC Bits -----------------------------------------------------
P3ASDOV          EQU  H'0000'
P3ARSEN          EQU  H'0005'
P3ASDEN          EQU  H'0006'
P3ASE            EQU  H'0007'


;----- PSMC3ASDL Bits -----------------------------------------------------
P3ASDLA          EQU  H'0000'
P3ASDLB          EQU  H'0001'
P3ASDLC          EQU  H'0002'
P3ASDLD          EQU  H'0003'
P3ASDLE          EQU  H'0004'
P3ASDLF          EQU  H'0005'


;----- PSMC3ASDS Bits -----------------------------------------------------
P3ASDSC1         EQU  H'0001'
P3ASDSC2         EQU  H'0002'
P3ASDSC3         EQU  H'0003'
P3ASDSC4         EQU  H'0004'
P3ASDSIN         EQU  H'0007'


;----- PSMC3INT Bits -----------------------------------------------------
P3TPRIF          EQU  H'0000'
P3TDCIF          EQU  H'0001'
P3TPHIF          EQU  H'0002'
P3TOVIF          EQU  H'0003'
P3TPRIE          EQU  H'0004'
P3TDCIE          EQU  H'0005'
P3TPHIE          EQU  H'0006'
P3TOVIE          EQU  H'0007'


;----- PSMC3PHL Bits -----------------------------------------------------
PSMC3PH0         EQU  H'0000'
PSMC3PH1         EQU  H'0001'
PSMC3PH2         EQU  H'0002'
PSMC3PH3         EQU  H'0003'
PSMC3PH4         EQU  H'0004'
PSMC3PH5         EQU  H'0005'
PSMC3PH6         EQU  H'0006'
PSMC3PH7         EQU  H'0007'


;----- PSMC3PHH Bits -----------------------------------------------------
PSMC3PH8         EQU  H'0000'
PSMC3PH9         EQU  H'0001'
PSMC3PH10        EQU  H'0002'
PSMC3PH11        EQU  H'0003'
PSMC3PH12        EQU  H'0004'
PSMC3PH13        EQU  H'0005'
PSMC3PH14        EQU  H'0006'
PSMC3PH15        EQU  H'0007'


